WELCOME_TEXT = """
С наступающим, дорогой друг <b>{username}</b>! Ты открыл календарь, где декабрь — это целый сериал из 31 серии добра, юмора и подарков.

Каждый день — новое окошко, новое пожелание и новый приз!

Как проверить, что время для викторины пришло? Кнопка "Начать игру" ждет твоего клика.

Но не пытайся открыть будущее: волшебство работает только «сегодня и сейчас» ;).

Готов? Тогда поехали навстречу чудесам! 

<b>Так что не забудь ознакомиться со всеми условиями игры. Желаем удачи!</b>
"""

RULES_TEXT = """<b>Это не просто игра. Это тамагочи про любовь :)</b>

Тебе нужно следить за состоянием своего персонажа:
он хочет есть, отдыхать, чувствовать заботу и иногда – немного денег на карте ;)

Можно:
 - загрузить фото своей половинки и вписать имя
 - или выбрать персонажа из предложенных и назвать как угодно (даже «Котик 3000»)

Если игнорировать сигналы – персонаж обидится и… ну, спойлеры ниже.
"""

CONDITIONS_TEXT = """<b> *Внимание, магия скидок! </b> 

Наши промокоды — штучный товар. 
Если не скопировать правильно, волшебство может не сработать. 
Срок действия ограничен (вечно живут только мемы). 
Не совместимы с другими акциями, скидками и оплатой баллами. 

<b> Чудеса не любят конкуренции </b>.
"""

CONGRATULATION_TEXT = """ Поздравляем! 🎉 

Твой тамагочи жив, счастлив и никуда не уезжает 😊
А вот и промокод от Суши Мастер: <b> {element} </b>
Потому что любовь – это забота. ❤️
А забота – это вовремя заказать роллы 😋 """

FAIL_TEXT_WOMEN = """

Я собираю чемоданы. Еду к маме.
Ты вспомнишь меня, когда будет поздно. 💔"""

FAIL_TEXT_MAN = """

😢 Я ушёл за хлебом. И больше не вернусь."""