WELCOME_TEXT = """
С Днём всех влюблённых! 💖🌹

<b>{username}</b>, добро пожаловать в игру «Тамагочи от Суши Мастер: роллы, деньги и обнимашки». 😍🥢

Здесь у тебя будет один важный персонаж – твоя половинка, за которой нужно внимательно ухаживать и заботливо следить. ❤️😊

Это особенное тамагочи, потому что:

✨ Вместо пушистого зверька – твой любимый человек!
📲 Вместо обычных кнопок – твои важные решения!
🏡 Вместо грустного «game over» – неожиданный чемодан у порога квартиры! 😱🎒

Следи за настроением своей второй половины, своевременно реагируй на изменения показателей – и тогда ваша любовь точно останется крепкой и счастливой! 👫👬

Готов испытать себя и показать, насколько ты внимательнее и заботливее обычного игрока? 🔥💪

Тогда смело нажимай <b>«Создать персонажа»</b> – и пусть твоя любовь навсегда останется рядом с тобой! 😉❣️
"""

RULES_TEXT = """
💞 Это не просто игра. 🌟Это настоящий тамагочи про отношения 😍  

Твоя главная цель: 
✅сохранить вашу связь живой и тёплой всего 2 дня, не давая вашей половинке уйти.  

У вашего героя есть разные состояния:
🍽️ Иногда хочется еды,
🛌 иногда отдыха,
💕 порой остро ощущается нехватка внимания и заботы,
💳 а временами нужны небольшие финансовые вложения на развлечения.  

Запомни важное правило:каждый два часа показатели чувств будут медленно уменьшаться, даже если кажется, что всё идеально. 
Потому что настоящая любовь требует постоянного участия и чуткости 😘  

Игнорируешь знаки внимания? Начнутся ссоры, а дальше... твой герой соберёт чемоданы и исчезнет 😢

Хорошая новость: ночью ваш герой спокойно отдыхает и не тревожит вас сигналами тревоги. 
Однако даже во сне сердце продолжает жить своей жизнью 🌙  

Вы можете:
📸 Загрузить фотографию своей любимой половинки и вписать её настоящее имя,
🐾 Или выбрать нашего забавного персонажа и назвать его любимым прозвищем («Мой Котик», «Зайчик»).  

Спаси ваши отношения в течение двух дней – и получите вкусный подарок от Суши Мастер 🍣  

Готов попробовать свои силы и стать настоящим мастером любви? 😏  
Жми «Создать персонажа» – и вперёд навстречу чувствам и приключениям! 💖
"""

CONDITIONS_TEXT = """<b> *Внимание, магия скидок! </b> 

Наши промокоды — штучный товар. 
Если не скопировать правильно, волшебство может не сработать. 
Срок действия ограничен (вечно живут только мемы). 
Не совместимы с другими акциями, скидками и оплатой баллами. 

<b> Чудеса не любят конкуренции </b>.
"""

CONGRATULATION_TEXT = """ Поздравляем! 🎉 

Твой тамагочи жив, счастлив и никуда не уезжает 😊
А вот и промокод от Суши Мастер: <b> {element} </b>
Потому что любовь – это забота. ❤️
А забота – это вовремя заказать роллы 😋 """

FAIL_TEXT_WOMEN = """

Я собираю чемоданы. Еду к маме.
Ты вспомнишь меня, когда будет поздно. 💔"""

FAIL_TEXT_MAN = """

😢 Я ушёл за хлебом. И больше не вернусь."""

MESSAGES_BY_PARAM_AND_GENDER = {
    'hunger': {
        'female': [
            "Я уже сыта, стоп!",
            "Я не голодна, но спасибо",
            "Можно без добавки",
            "Не хочу переедать",
            "Я наелась, честно",
            "Еще кусочек и +1 размер",
            "Хочу остаться стройной версией себя",
            "Еще немного и мои джинсы обидятся",
            "Еще чуть-чуть и минус талия",
            "Хочешь, чтобы я лопнула?"
        ],
        'male': [
            "Больше не влезет",
            "Я уже поел",
            "Максимально заправился",
            "Всё, дальше – перебор",
            "Хватит, мне еще двигаться",
            "Еды достаточно, правда",
            "Я не хочу плюс пузо",
            "Если еще – я стану колобком",
            "Давай без набора массы",
            "Я уже не голоден"
        ]
    },
    'money_needs': {
        'female': [
            "Я уже вся в любви",
            "Я и так уже растаяла",
            "Мое сердце переполнено любовью",
            "Любви достаточно",
            "Хочешь меня разбаловать?",
            "Я уже счастлива",
            "Эмоционально я сыта",
            "Любовный лимит достигнут",
            "Я на максимуме нежности",
            "Мне уже очень хорошо"
        ],
        'male': [
            "Мне хватает заботы",
            "Я не нуждаюсь сейчас",
            "Заботы достаточно",
            "Мне хватило внимания, спасибо",
            "Это приятно, но я уже в порядке",
            "Уже все хорошо",
            "Хватит, а то разбалуешь меня",
            "Я переполнен вниманием",
            "Так приятно, но, пожалуй, хватит",
            "Я уже доволен на 100%"
        ]
    },
    'entertainment': {
        'female': [
            "Деньги есть, паники уже нет",
            "Я уже финансово спокойна",
            "Моя банковская карта уже не плачет",
            "С деньгами уже все норм",
            "С балансом уже все ок",
            "Больше не нуждаюсь в инвестициях",
            "Все в порядке – деньги есть",
            "Мне уже хватает, спасибо",
            "Теперь я уверена в завтрашнем дне",
            "Деньги уже не проблема"
        ],
        'male': [
            "Я уже перезагрузился",
            "Голова проветрилась",
            "Развеялся по максимуму",
            "Сейчас мне уже норм",
            "Баланс уже восстановлен",
            "Больше не хочу гулять",
            "Хватит, теперь побуду с тобой",
            "Можно я теперь дома полежу?",
            "Ты – прелесть, но я уже развеялся",
            "Может позже? Сейчас не хочется"
        ]
    },
    'fatigue': {
        'female': [
            "Я уже отдохнула",
            "Энергия восстановлена",
            "Можно без дополнительного отдыха",
            "Я бодрая, ты не заметил?",
            "Я уже в ресурсе",
            "Сейчас я уже полна сил",
            "Ты – душка, но СПА достаточно",
            "Баланс уже восстановлен, еще много дел",
            "Да сколько можно? Надоело отдыхать!",
            "Хватит с меня релакса"
        ],
        'male': [
            "Сил хватает",
            "Я отдохнул",
            "Я уже бодрый",
            "Полон сил и энергии",
            "Отдых засчитан, мне норм",
            "Перезарядка завершена",
            "Я же не кабачок все время лежать",
            "Надоел диван",
            "Хочешь, чтобы я впал в кому?",
            "Теперь пришло время тратить энергию"
        ]
    }
}