WELCOME_TEXT = """
С Днём всех влюблённых! 💖🌹

<b>{username}</b>, добро пожаловать в игру «Тамагочи от Суши Мастер: роллы, деньги и обнимашки». 😍🥢

Здесь у тебя будет один важный персонаж – твоя половинка, за которой нужно внимательно ухаживать и заботливо следить. ❤️😊

Это особенное тамагочи, потому что:

✨ Вместо пушистого зверька – твой любимый человек!
📲 Вместо обычных кнопок – твои важные решения!
🏡 Вместо грустного «game over» – неожиданный чемодан у порога квартиры! 😱🎒

Следи за настроением своей второй половины, своевременно реагируй на изменения показателей – и тогда ваша любовь точно останется крепкой и счастливой! 👫👬

Готов испытать себя и показать, насколько ты внимательнее и заботливее обычного игрока? 🔥💪

Тогда смело нажимай <b>«Создать персонажа»</b> – и пусть твоя любовь навсегда останется рядом с тобой! 😉❣️
"""

RULES_TEXT = """
Это не просто игра. Это тамагочи про любовь 😍

Тебе нужно внимательно следить за состоянием своего любимого персонажа:
🍜 он хочет вкусно покушать,
🛀 отдохнуть после насыщенного дня,
💗 почувствовать твою заботу и внимание,
💸 иногда даже пополнить баланс карты деньгами на развлечения.  

Ты можешь:  
📸 загрузить фотографию своей настоящей половинки и вписать настоящее имя  
🐾 или выбрать забавного персонажа из списка и назвать его любым ласковым прозвищем ("Котик 3000", "Медвежонок", "Солнышко").

⚠️ Но будь осторожен! Игнорируя потребности персонажа, рискуешь увидеть неприятный сюрприз — чемодан у двери и слёзы на глазах 😢  

🔋 Готов начать играть и доказать, что ты лучший партнёр? Жми <b>"Создать персонажа"!</b>
"""

CONDITIONS_TEXT = """<b> *Внимание, магия скидок! </b> 

Наши промокоды — штучный товар. 
Если не скопировать правильно, волшебство может не сработать. 
Срок действия ограничен (вечно живут только мемы). 
Не совместимы с другими акциями, скидками и оплатой баллами. 

<b> Чудеса не любят конкуренции </b>.
"""

CONGRATULATION_TEXT = """ Поздравляем! 🎉 

Твой тамагочи жив, счастлив и никуда не уезжает 😊
А вот и промокод от Суши Мастер: <b> {element} </b>
Потому что любовь – это забота. ❤️
А забота – это вовремя заказать роллы 😋 """

FAIL_TEXT_WOMEN = """

Я собираю чемоданы. Еду к маме.
Ты вспомнишь меня, когда будет поздно. 💔"""

FAIL_TEXT_MAN = """

😢 Я ушёл за хлебом. И больше не вернусь."""