promotions = [
    {"number": "1", 
     "name": "Калифорния микс", 
     "сondition": "Ролл Калифорния микс в подарок от чека 1800 рублей. Действует с 01.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY5821"},

    {"number": "2", 
     "name": "Онигири с креветкой в подарок", 
     "сondition": "Онигири с креветкой в подарок от чека 1700 рублей. Действует с 02.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY9473"},

    {"number": "3", 
     "name": "Филадельфия унаги", 
     "сondition": "Ролл Филадельфия унаги в подарок от чека 1700 рублей. Действует с 03.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1034"},

    {"number": "4", 
     "name": "Дон бекон", 
     "сondition": "Ролл Дон бекон в подарок от чека 1700 рублей. Действует с 04.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY7368"},

    {"number": "5", 
     "name": "Скидка 11% на роллы", 
     "сondition": "Скидка 11% на роллы при покупке от 3х роллов в одном чеке. Действует с 05.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY2197"},
     
    {"number": "6", 
     "name": "Нежный с лососем запеченный", 
     "сondition": "Ролл Нежный с лососем запеченный в подарок от чека 1700 рублей. Действует с 06.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY8640"},

    {"number": "7", 
     "name": "Онигири с лососем", 
     "сondition": "Онигири с лососем в подарок от чека 1800 рублей. Действует с 07.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY4952"},

    {"number": "8", 
     "name": "Филадельфия темпура", 
     "сondition": "Ролл Филадельфия темпура в подарок от чека 1800 рублей. Действует с 08.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY3186"},

    {"number": "9", 
     "name": "Калифорния темпура", 
     "сondition": "Ролл Калифорния темпура в подарок от чека 1500 рублей. Действует с 09.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY7705"},

    {"number": "10", 
     "name": "Скидка 11% на основное меню", 
     "сondition": "Скидка 11% на основное меню от чека 1800 р. Действует с 10.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY6429"},

    {"number": "11", 
     "name": "Онигири с тунцом и креветкой", 
     "сondition": "Онигири с тунцом и креветкой от чека 1800 рублей. Действует с 11.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY5501"},

    {"number": "12", 
     "name": "Лосось гриль сяке запечённый", 
     "сondition": "Ролл Лосось гриль сяке запечённый в подарок от чека 1900 рублей. Действует с 12.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY2890"},

    {"number": "13", 
     "name": "Крабонара запечённый", 
     "сondition": "Ролл Крабонара запечённый в подарок от чека 1700 рублей. Действует с 13.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY9348"},

    {"number": "14", 
     "name": "Скидка 13 % на сеты", 
     "сondition": "Скидка 13% на неакционные сеты. Действует с 14.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1576"},

    {"number": "15", 
     "name": "Огненная жемчужина", 
     "сondition": "Ролл Огненная жемчужина в подарок от чека 2000 рублей. Действует с 15.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY8012"},

    {"number": "16", 
     "name": "Крабстер темпура", 
     "сondition": "Ролл Крабстер темпура в подарок от чека 1800 рублей. Действует с 16.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY6734"},

    {"number": "17", 
     "name": "Лосось чили темпура", 
     "сondition": "Ролл Лосось чили темпура в подарок от чека 1900 рублей. Действует с 17.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY4207"},

    {"number": "18", 
     "name": "Скидка 160 рублей на заказ", 
     "сondition": "Скидка 160 рублей от чека 1900 рублей. Действует в период с 18.12.2025 по 26.12.2025. Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY9983"},

    {"number": "19", 
     "name": "Калифорния в кунжуте", 
     "сondition": "Ролл Калифорния в кунжуте в подарок от чека 1700 рублей. Действует с 21.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY2359"},

    {"number": "20", 
     "name": "Суши-пицца с лососем", 
     "сondition": "Суши-пицца с лососем в подарок от чека 2100 рублей. Действует с 22.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY7114"},

    {"number": "21", 
     "name": "Крабьен запечённый", 
     "сondition": "Ролл Крабьен запечённый в подарок от чека 1800 рублей. Действует с 23.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY4682"},

    {"number": "22", 
     "name": "Краб фри темпура", 
     "сondition": "Ролл Краб фри темпура в подарок от чека 1500 рублей. Действует с 05.01.2026 по 13.01.2026 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY3571"},

    {"number": "23", 
     "name": "Скидка 15 % на сеты", 
     "сondition": "Скидка 15% на неакционные сеты. Действует с 14.12.2025 по 25.12.2025 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY8846"},

    {"number": "24", 
     "name": "Огненная креветка", 
     "сondition": "Ролл Огненная креветка в подарок от чека 2000 рублей. Действует с 05.01.2026 по 13.01.2026 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1265"},

    {"number": "25", 
     "name": "Калифорния терияки", 
     "сondition": "Ролл Калифорния терияки в подарок от чека 1750 рублей. Действует с 05.01.2026 по 13.01.2026 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1266"},

    {"number": "26", 
     "name": "Нежный с угрём запечённый", 
     "сondition": "Ролл Нежный с угрём запечённый в подарок от чека 1700 рублей. Действует с 05.01.2026 по 13.01.2026 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1267"},

    {"number": "27", 
     "name": "Комбо Фри", 
     "сondition": "Комбо фри в подарок от чека 1800 рублей. Действует с 05.01.2026 по 13.01.2026 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1268"},

    {"number": "28", 
     "name": "Чеддер", 
     "сondition": "Ролл Чеддер в подарок от чека 1900 рублей. Действует с 05.01.2026 по 13.01.2026 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1269"},

    {"number": "29", 
     "name": "Скидка 200 рублей на заказ", 
     "сondition": "Скидка 200 рублей от чека 2000 рублей. Действует в период с 18.12.2025 по 26.12.2025. Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1270"},

    {"number": "30", 
     "name": "Чизкейк ванильный", 
     "сondition": "Чизкейк ваинильный в подарок от чека 1900 рублей. Действует в период с 18.12.2025 по 26.12.2025. Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1271"},

    {"number": "31", 
     "name": "Чикен барбекю", 
     "сondition": "Ролл Чикен барбекю в подарок от чека 1800 рублей. Действует с 05.01.2026 по 13.01.2026 Не суммируется с другими акциями, промокодами и скидками.", 
     "promotional_code": "HNY1272"}

]
